app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("title", "description", "image_url", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["image_url", ""], ["category", ""], ["created_at", 2016-12-12 20:51:36 UTC], ["updated_at", 2016-12-12 20:51:36 UTC]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "image_url" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_url", "LEMON.jpg"], ["updated_at", 2017-08-13 14:55:23 UTC], ["id", 8]]